leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5746c_portdefs.h
/* Pad: 69 */
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_ADC PORT_FUNC3 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_69 {533,2} 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_69 {805,4} 

/* Pad: 70 */
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_ADC PORT_FUNC3 
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_70 {534,2} 

/* Pad: 71 */
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_ADC PORT_FUNC3 
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_71 {535,2} 

/* Pad: 72 */
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_LIN PORT_FUNC5 
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_72 {534,3} 

/* Pad: 73 */
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_73 {535,3} 
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_CAN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_73 {702,1} 
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_73 {703,3} 

/* Pad: 74 */
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_LIN PORT_FUNC1 
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_74 {578,2} 

/* Pad: 75 */
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_75 {536,3} 
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_75 {715,2} 

/* Pad: 76 */
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_76 {567,2} 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_SPI PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_76 {806,2} 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_76 {970,1} 

/* Pad: 77 */
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_77 {568,2} 
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_77 {966,1} 

/* Pad: 78 */
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_78 {569,2} 
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_78 {807,2} 

/* Pad: 79 */
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_79 {570,2} 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_79 {808,2} 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_79 {819,1} 

/* Pad: 80 */
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_CAN PORT_FUNC4 
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER0 PORT_FUNC7 
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_80 {522,3} 

/* Pad: 81 */
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_81 {523,3} 

