leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5746c_portdefs.h
/* Pad: 82 */
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_82 {524,3} 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_82 {808,3} 

/* Pad: 83 */
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_83 {525,4} 

/* Pad: 84 */
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_84 {526,4} 

/* Pad: 85 */
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_85 {534,4} 

/* Pad: 86 */
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_86 {535,4} 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER3 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_86 {542,5} 

/* Pad: 87 */
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_87 {813,1} 

/* Pad: 88 */
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_PWM PORT_FUNC4 
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_88 {527,3} 

/* Pad: 89 */
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_89 {549,2} 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_CAN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_89 {702,2} 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_89 {703,4} 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER3 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_89 {526,5} 

/* Pad: 90 */
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_90 {550,2} 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER3 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_90 {531,3} 

/* Pad: 91 */
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_91 {551,2} 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_91 {716,2} 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_91 {532,3} 

/* Pad: 92 */
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_92 {573,2} 
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER3 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_92 {528,3} 

/* Pad: 93 */
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_93 {574,2} 
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_93 {717,2} 
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER2 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_93 {534,5} 

