leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5746c_portdefs.h
/* Pad: 94 */
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_ETH PORT_FUNC4 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_94 {575,2} 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_94 {962,1} 

/* Pad: 95 */
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_95 {552,2} 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_CAN PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_95 {701,4} 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_95 {704,3} 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_95 {969,1} 

/* Pad: 96 */
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_ETH PORT_FUNC3 
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_96 {571,2} 

/* Pad: 97 */
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_97 {572,2} 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_CAN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_97 {705,2} 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_97 {961,1} 

/* Pad: 98 */
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_CAN PORT_FUNC3 
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_LIN PORT_FUNC4 
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_98 {559,2} 

/* Pad: 99 */
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_99 {560,2} 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_CAN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_99 {707,1} 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_99 {811,1} 

/* Pad: 100 */
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_LIN PORT_FUNC3 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_100 {561,2} 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_100 {810,1} 

/* Pad: 101 */
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_101 {562,2} 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_101 {722,1} 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_SPI PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_101 {809,1} 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_101 {514,4} 

/* Pad: 102 */
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_102 {563,2} 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_OTHER3 PORT_FUNC6 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_102 {515,6} 

/* Pad: 103 */
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_103 {564,2} 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_103 {578,3} 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_103 {718,1} 

/* Pad: 104 */
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_SPI PORT_FUNC3 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_CAN PORT_FUNC4 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_104 {565,2} 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_104 {808,4} 

/* Pad: 105 */
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_105 {566,2} 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_CAN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_105 {707,2} 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_105 {719,1} 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_105 {807,3} 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER3 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_105 {512,5} 

/* Pad: 106 */
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_106 {536,4} 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_106 {579,3} 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_SPI PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_106 {812,1} 

/* Pad: 107 */
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_107 {537,3} 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_107 {814,1} 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_107 {820,1} 

