leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5746c_portdefs.h
/* Pad: 108 */
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_ETH PORT_FUNC4 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_108 {538,3} 

/* Pad: 109 */
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_ETH PORT_FUNC4 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_109 {539,3} 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_109 {813,2} 

/* Pad: 110 */
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_110 {548,2} 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_SPI PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_110 {818,1} 

/* Pad: 111 */
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_111 {549,3} 
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_111 {720,1} 

/* Pad: 112 */
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_ETH PORT_FUNC3 
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_112 {550,3} 
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_SPI PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_112 {803,4} 

/* Pad: 113 */
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_ETH PORT_FUNC4 
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_113 {551,3} 

/* Pad: 114 */
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_ETH PORT_FUNC4 
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_114 {552,3} 
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_114 {804,3} 

/* Pad: 115 */
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_ETH PORT_FUNC3 
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_115 {553,2} 
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_115 {805,5} 

/* Pad: 116 */
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_116 {554,2} 

/* Pad: 117 */
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_117 {555,2} 
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_SPI PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_117 {821,1} 

/* Pad: 118 */
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_ADC PORT_FUNC3 
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_118 {556,2} 
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_118 {822,1} 

/* Pad: 119 */
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_ADC PORT_FUNC3 
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_119 {557,2} 
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_119 {823,1} 

/* Pad: 120 */
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_ADC PORT_FUNC3 
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_120 {558,2} 

/* Pad: 121 */
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_DIO PORT_FUNC0 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_121 {121,1} 

