leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5746c_portdefs.h
/* Pad: 122 */
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 123 */
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_123 {553,3} 
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_123 {814,2} 

/* Pad: 124 */
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_124 {573,3} 
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_124 {810,2} 

/* Pad: 125 */
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_125 {574,3} 
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_125 {811,2} 

/* Pad: 126 */
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_126 {575,3} 
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_126 {813,3} 

/* Pad: 127 */
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_127 {565,3} 

/* Pad: 128 */
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_128 {540,3} 

/* Pad: 129 */
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_129 {541,3} 
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_129 {720,2} 

/* Pad: 130 */
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_130 {542,4} 

/* Pad: 131 */
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_131 {543,4} 
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_131 {721,1} 

/* Pad: 132 */
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_132 {576,3} 

/* Pad: 133 */
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_133 {577,3} 
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_OTHER3 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_133 {813,4} 

/* Pad: 134 */
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_134 {578,4} 
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER3 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_134 {814,3} 
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER4 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_134 {817,1} 
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER5 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_134 {820,2} 

/* Pad: 135 */
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_135 {579,4} 

/* Pad: 136 */
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 137 */
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_ADC PORT_FUNCADC 

