leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5746c_portdefs.h
/* Pad: 158 */
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_SPI PORT_FUNC3 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_PWM PORT_FUNC6 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_158 {562,3} 

/* Pad: 159 */
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_159 {561,3} 
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_CAN PORT_FUNC6 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_159 {701,6} 
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_159 {703,5} 

/* Pad: 160 */
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_PWM PORT_FUNC4 
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_160 {560,3} 

/* Pad: 161 */
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_161 {549,4} 
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_CAN PORT_FUNC6 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_161 {704,6} 
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_161 {518,4} 

/* Pad: 162 */
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_162 {550,4} 

/* Pad: 163 */
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_163 {548,3} 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_163 {551,4} 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_CAN PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_163 {705,3} 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_LIN PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_163 {720,3} 

/* Pad: 164 */
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_164 {549,5} 
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_164 {521,3} 

/* Pad: 165 */
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_165 {552,4} 
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_CAN PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_165 {702,4} 
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_LIN PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_165 {714,3} 
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_165 {522,4} 

/* Pad: 166 */
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_PWM PORT_FUNC4 
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_166 {553,4} 
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_166 {523,4} 

/* Pad: 167 */
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_167 {554,3} 
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_CAN PORT_FUNC6 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_167 {703,6} 
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_LIN PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_167 {715,3} 
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_167 {524,4} 

/* Pad: 168 */
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_PWM PORT_FUNC4 
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_168 {555,3} 
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_OTHER2 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_168 {525,5} 

/* Pad: 169 */
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_169 {577,4} 
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_169 {727,2} 
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_SPI PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_169 {812,3} 

/* Pad: 170 */
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_LIN PORT_FUNC3 
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_170 {578,5} 

/* Pad: 171 */
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_LIN PORT_FUNC3 
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_171 {579,5} 
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_171 {813,5} 

