leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5746c_portdefs.h
/* Pad: 172 */
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_172 {512,4} 
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_172 {726,2} 
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_172 {814,5} 

/* Pad: 173 */
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_PWM PORT_FUNC4 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_173 {513,4} 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_CAN PORT_FUNC7 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_173 {703,7} 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_173 {816,2} 

/* Pad: 174 */
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_PWM PORT_FUNC4 
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_174 {514,3} 
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_174 {817,3} 

/* Pad: 175 */
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_LIN PORT_FUNC3 
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_175 {515,5} 
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_175 {815,2} 
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_175 {821,2} 

/* Pad: 176 */
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_PWM PORT_FUNC4 
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_176 {516,4} 
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_176 {725,2} 

/* Pad: 177 */
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 178 */
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 179 */
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 180 */
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 181 */
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 182 */
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 183 */
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 184 */
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_DIO PORT_FUNC0 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_184 {184,1} 

/* Pad: 185 */
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 186 */
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 187 */
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 188 */
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 189 */
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 190 */
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 191 */
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 192 */
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 193 */
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 194 */
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 195 */
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_195 {843,1} 

/* Pad: 196 */
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 197 */
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 198 */
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_DIO PORT_FUNC0 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_198 {198,2} 

