leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5746c_portdefs.h
/* Pad: 199 */
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 200 */
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 201 */
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 202 */
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 205 */
#define PIN_FUNCTION_REG_205_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_205_PORT_PIN_MODE_OTHER0 PORT_FUNC2 

/* Pad: 206 */
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 224 */
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_LIN PORT_FUNC3 

/* Pad: 225 */
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_225 {724,2} 

/* Pad: 252 */
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_252 {572,3} 
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_252 {820,4} 

/* Pad: 253 */
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_253 {571,3} 

/* Pad: 254 */
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_254 {570,3} 
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_254 {819,2} 

/* Pad: 255 */
#define PIN_FUNCTION_REG_255_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_255_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_255_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_255 {569,3} 
#define PIN_FUNCTION_REG_255_PORT_PIN_MODE_SPI PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_255 {818,2} 

/* Pad: 256 */
#define PIN_FUNCTION_REG_256_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_256_PORT_PIN_MODE_SPI PORT_FUNC1 

/* Pad: 257 */
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_257 {802,4} 

/* Pad: 258 */
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_258 {801,3} 

/* Pad: 259 */
#define PIN_FUNCTION_REG_259_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_259_PORT_PIN_MODE_SPI PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_259 {800,2} 

/* Pad: 260 */
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_260 {576,4} 

/* Pad: 261 */
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_261 {575,4} 

/* Pad: 262 */
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_262 {574,4} 

/* Pad: 263 */
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_263 {573,4} 


#endif  /* _MPC5746CPORTDEFS_H*/ 
